frostfire45/Codewarrior/Lib/hc12c/include/mc9s12vr16.h
extern volatile HSSRSTR _HSSR @(REG_BASE + 0x00000145UL);
#define HSSR                            _HSSR.Byte
#define HSSR_HSOL0                      _HSSR.Bits.HSOL0

#define HSSR_HSOL0_MASK                 1U


/*** HSIE - HSDRV Interrupt Enable Register; 0x00000146 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte HSOCIE      :1;                                       /* HSDRV Error Interrupt Enable */
  } Bits;
} HSIESTR;
extern volatile HSIESTR _HSIE @(REG_BASE + 0x00000146UL);
#define HSIE                            _HSIE.Byte
#define HSIE_HSOCIE                     _HSIE.Bits.HSOCIE

#define HSIE_HSOCIE_MASK                128U


/*** HSIF - HSDRV Interrupt Flag Register; 0x00000147 ***/
typedef union {
  byte Byte;
  struct {
    byte HSOCIF0     :1;                                       /* HSDRV Over-Current Interrupt Flag 0 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} HSIFSTR;
extern volatile HSIFSTR _HSIF @(REG_BASE + 0x00000147UL);
#define HSIF                            _HSIF.Byte
#define HSIF_HSOCIF0                    _HSIF.Bits.HSOCIF0

#define HSIF_HSOCIF0_MASK               1U


/*** LSDR - Port LS Data Register; 0x00000150 ***/
typedef union {
  byte Byte;
  struct {
    byte LSDR0       :1;                                       /* Port LS Data Bit 0 */
    byte LSDR1       :1;                                       /* Port LS Data Bit 1 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpLSDR :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} LSDRSTR;
extern volatile LSDRSTR _LSDR @(REG_BASE + 0x00000150UL);
#define LSDR                            _LSDR.Byte
#define LSDR_LSDR0                      _LSDR.Bits.LSDR0
#define LSDR_LSDR1                      _LSDR.Bits.LSDR1
#define LSDR_LSDR                       _LSDR.MergedBits.grpLSDR

#define LSDR_LSDR0_MASK                 1U
#define LSDR_LSDR1_MASK                 2U
#define LSDR_LSDR_MASK                  3U
#define LSDR_LSDR_BITNUM                0U


/*** LSCR - LSDRV Configuration Register; 0x00000151 ***/
typedef union {
  byte Byte;
  struct {
    byte LSE0        :1;                                       /* LSDRV Enable Bit 0 */
    byte LSE1        :1;                                       /* LSDRV Enable Bit 1 */
    byte LSOLE0      :1;                                       /* LSDRV High-Load resistance Open-Load Detection Enable Bit 0 */
    byte LSOLE1      :1;                                       /* LSDRV High-Load resistance Open-Load Detection Enable Bit 1 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpLSE  :2;
    byte grpLSOLE :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} LSCRSTR;
extern volatile LSCRSTR _LSCR @(REG_BASE + 0x00000151UL);
#define LSCR                            _LSCR.Byte
#define LSCR_LSE0                       _LSCR.Bits.LSE0
#define LSCR_LSE1                       _LSCR.Bits.LSE1
#define LSCR_LSOLE0                     _LSCR.Bits.LSOLE0
#define LSCR_LSOLE1                     _LSCR.Bits.LSOLE1
#define LSCR_LSE                        _LSCR.MergedBits.grpLSE
#define LSCR_LSOLE                      _LSCR.MergedBits.grpLSOLE

#define LSCR_LSE0_MASK                  1U
#define LSCR_LSE1_MASK                  2U
#define LSCR_LSOLE0_MASK                4U
#define LSCR_LSOLE1_MASK                8U
#define LSCR_LSE_MASK                   3U
#define LSCR_LSE_BITNUM                 0U
#define LSCR_LSOLE_MASK                 12U
#define LSCR_LSOLE_BITNUM               2U


/*** LSSR - LSDRV Status Register; 0x00000155 ***/
typedef union {
  byte Byte;
  struct {
    byte LSOL0       :1;                                       /* LSDRV Open-Load Status Bit 0 */
    byte LSOL1       :1;                                       /* LSDRV Open-Load Status Bit 1 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpLSOL :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} LSSRSTR;
extern volatile LSSRSTR _LSSR @(REG_BASE + 0x00000155UL);
#define LSSR                            _LSSR.Byte
#define LSSR_LSOL0                      _LSSR.Bits.LSOL0
#define LSSR_LSOL1                      _LSSR.Bits.LSOL1
#define LSSR_LSOL                       _LSSR.MergedBits.grpLSOL

#define LSSR_LSOL0_MASK                 1U
#define LSSR_LSOL1_MASK                 2U
#define LSSR_LSOL_MASK                  3U
#define LSSR_LSOL_BITNUM                0U


/*** LSIE - LSDRV Interrupt Enable Register; 0x00000156 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte LSOCIE      :1;                                       /* LSDRV Error Interrupt Enable */
  } Bits;
} LSIESTR;
extern volatile LSIESTR _LSIE @(REG_BASE + 0x00000156UL);
#define LSIE                            _LSIE.Byte
#define LSIE_LSOCIE                     _LSIE.Bits.LSOCIE

#define LSIE_LSOCIE_MASK                128U


/*** LSIF - LSDRV Interrupt Flag Register; 0x00000157 ***/
typedef union {
  byte Byte;
  struct {
    byte LSOCIF0     :1;                                       /* LSDRV Over-Current Interrupt Flag 0 */
    byte LSOCIF1     :1;                                       /* LSDRV Over-Current Interrupt Flag 1 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpLSOCIF :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} LSIFSTR;
extern volatile LSIFSTR _LSIF @(REG_BASE + 0x00000157UL);
#define LSIF                            _LSIF.Byte
#define LSIF_LSOCIF0                    _LSIF.Bits.LSOCIF0
#define LSIF_LSOCIF1                    _LSIF.Bits.LSOCIF1
#define LSIF_LSOCIF                     _LSIF.MergedBits.grpLSOCIF

#define LSIF_LSOCIF0_MASK               1U
#define LSIF_LSOCIF1_MASK               2U
#define LSIF_LSOCIF_MASK                3U
#define LSIF_LSOCIF_BITNUM              0U


/*** LPDR - Port LP Data Register; 0x00000160 ***/
typedef union {
  byte Byte;
  struct {
    byte LPDR0       :1;                                       /* LIN Rx data */
    byte LPDR1       :1;                                       /* LIN Tx data */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpLPDR :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} LPDRSTR;
extern volatile LPDRSTR _LPDR @(REG_BASE + 0x00000160UL);
#define LPDR                            _LPDR.Byte
#define LPDR_LPDR0                      _LPDR.Bits.LPDR0
#define LPDR_LPDR1                      _LPDR.Bits.LPDR1
#define LPDR_LPDR                       _LPDR.MergedBits.grpLPDR

#define LPDR_LPDR0_MASK                 1U
#define LPDR_LPDR1_MASK                 2U
#define LPDR_LPDR_MASK                  3U
#define LPDR_LPDR_BITNUM                0U


/*** LPCR - LIN Control Register; 0x00000161 ***/
typedef union {
  byte Byte;
  struct {
    byte LPPUE       :1;                                       /* LIN pull-up enable */
    byte LPWUE       :1;                                       /* LIN wake-up enable */
    byte RXONLY      :1;                                       /* Receive only mode */
    byte LPE         :1;                                       /* LIN enable */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} LPCRSTR;
