frostfire45/Codewarrior/Lib/hc12c/include/mc9s12vr16.h
extern volatile PPSTSTR _PPST @(REG_BASE + 0x00000245UL);
#define PPST                            _PPST.Byte
#define PPST_PPST0                      _PPST.Bits.PPST0
#define PPST_PPST1                      _PPST.Bits.PPST1
#define PPST_PPST2                      _PPST.Bits.PPST2
#define PPST_PPST3                      _PPST.Bits.PPST3
#define PPST_PPST                       _PPST.MergedBits.grpPPST

#define PPST_PPST0_MASK                 1U
#define PPST_PPST1_MASK                 2U
#define PPST_PPST2_MASK                 4U
#define PPST_PPST3_MASK                 8U
#define PPST_PPST_MASK                  15U
#define PPST_PPST_BITNUM                0U


/*** MODRR - Port T Routing Register; 0x00000246 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** MODRR0 - Port T Routing Register Low; 0x00000246 ***/
    union {
      byte Byte;
      struct {
        byte MODRR00     :1;                                       /* Port T  routing */
        byte MODRR01     :1;                                       /* Port T  routing */
        byte MODRR02     :1;                                       /* Port T  routing */
        byte MODRR03     :1;                                       /* Port T  routing */
        byte MODRR04     :1;                                       /* Port T  routing */
        byte MODRR05     :1;                                       /* Port T  routing */
        byte             :1; 
        byte             :1; 
      } Bits;
      struct {
        byte grpMODRR0 :6;
        byte     :1;
        byte     :1;
      } MergedBits;
    } MODRR0STR;
    #define MODRR0                      _MODRR.Overlap_STR.MODRR0STR.Byte
    #define MODRR0_MODRR00              _MODRR.Overlap_STR.MODRR0STR.Bits.MODRR00
    #define MODRR0_MODRR01              _MODRR.Overlap_STR.MODRR0STR.Bits.MODRR01
    #define MODRR0_MODRR02              _MODRR.Overlap_STR.MODRR0STR.Bits.MODRR02
    #define MODRR0_MODRR03              _MODRR.Overlap_STR.MODRR0STR.Bits.MODRR03
    #define MODRR0_MODRR04              _MODRR.Overlap_STR.MODRR0STR.Bits.MODRR04
    #define MODRR0_MODRR05              _MODRR.Overlap_STR.MODRR0STR.Bits.MODRR05
    /* MODRR_ARR: Access 2 MODRRx registers in an array */
    #define MODRR_ARR                   ((volatile byte *) &MODRR0)
    #define MODRR0_MODRR0               _MODRR.Overlap_STR.MODRR0STR.MergedBits.grpMODRR0
    
    #define MODRR0_MODRR00_MASK         1U
    #define MODRR0_MODRR01_MASK         2U
    #define MODRR0_MODRR02_MASK         4U
    #define MODRR0_MODRR03_MASK         8U
    #define MODRR0_MODRR04_MASK         16U
    #define MODRR0_MODRR05_MASK         32U
    #define MODRR0_MODRR0_MASK          63U
    #define MODRR0_MODRR0_BITNUM        0U
    

    /*** MODRR1 - Port T Routing Register High; 0x00000247 ***/
    union {
      byte Byte;
      struct {
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
      } Bits;
    } MODRR1STR;
    #define MODRR1                      _MODRR.Overlap_STR.MODRR1STR.Byte
    
  } Overlap_STR;

  struct {
    word MODRR00     :1;                                       /* Port T  routing */
    word MODRR01     :1;                                       /* Port T  routing */
    word MODRR02     :1;                                       /* Port T  routing */
    word MODRR03     :1;                                       /* Port T  routing */
    word MODRR04     :1;                                       /* Port T  routing */
    word MODRR05     :1;                                       /* Port T  routing */
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
  } Bits;
  struct {
    word grpMODRR0 :6;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
  } MergedBits;
} MODRRSTR;
extern volatile MODRRSTR _MODRR @(REG_BASE + 0x00000246UL);
#define MODRR                           _MODRR.Word
#define MODRR_MODRR00                   _MODRR.Bits.MODRR00
#define MODRR_MODRR01                   _MODRR.Bits.MODRR01
#define MODRR_MODRR02                   _MODRR.Bits.MODRR02
#define MODRR_MODRR03                   _MODRR.Bits.MODRR03
#define MODRR_MODRR04                   _MODRR.Bits.MODRR04
#define MODRR_MODRR05                   _MODRR.Bits.MODRR05
#define MODRR_MODRR0                    _MODRR.MergedBits.grpMODRR0

#define MODRR_MODRR00_MASK              1U
#define MODRR_MODRR01_MASK              2U
#define MODRR_MODRR02_MASK              4U
#define MODRR_MODRR03_MASK              8U
#define MODRR_MODRR04_MASK              16U
#define MODRR_MODRR05_MASK              32U
#define MODRR_MODRR0_MASK               63U
#define MODRR_MODRR0_BITNUM             0U


/*** PTS - Port S Data Register; 0x00000248 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte PTS2        :1;                                       /* Port S general purpose input/output data bit 2 */
    byte PTS3        :1;                                       /* Port S general purpose input/output data bit 3 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte grpPTS_2 :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} PTSSTR;
extern volatile PTSSTR _PTS @(REG_BASE + 0x00000248UL);
#define PTS                             _PTS.Byte
#define PTS_PTS2                        _PTS.Bits.PTS2
#define PTS_PTS3                        _PTS.Bits.PTS3
#define PTS_PTS_2                       _PTS.MergedBits.grpPTS_2

