frostfire45/Codewarrior/Lib/hc12c/include/mc9s12vr16.h
#define PIRL_PIRL0_MASK                 1U
#define PIRL_PIRL1_MASK                 2U
#define PIRL_PIRL2_MASK                 4U
#define PIRL_PIRL3_MASK                 8U
#define PIRL_PIRL_MASK                  15U
#define PIRL_PIRL_BITNUM                0U


/*** PPSL - Port L Polarity Select Register; 0x0000026D ***/
typedef union {
  byte Byte;
  struct {
    byte PPSL0       :1;                                       /* Pin Interrupt Polarity Select Port L Bit 0 */
    byte PPSL1       :1;                                       /* Pin Interrupt Polarity Select Port L Bit 1 */
    byte PPSL2       :1;                                       /* Pin Interrupt Polarity Select Port L Bit 2 */
    byte PPSL3       :1;                                       /* Pin Interrupt Polarity Select Port L Bit 3 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpPPSL :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} PPSLSTR;
extern volatile PPSLSTR _PPSL @(REG_BASE + 0x0000026DUL);
#define PPSL                            _PPSL.Byte
#define PPSL_PPSL0                      _PPSL.Bits.PPSL0
#define PPSL_PPSL1                      _PPSL.Bits.PPSL1
#define PPSL_PPSL2                      _PPSL.Bits.PPSL2
#define PPSL_PPSL3                      _PPSL.Bits.PPSL3
#define PPSL_PPSL                       _PPSL.MergedBits.grpPPSL

#define PPSL_PPSL0_MASK                 1U
#define PPSL_PPSL1_MASK                 2U
#define PPSL_PPSL2_MASK                 4U
#define PPSL_PPSL3_MASK                 8U
#define PPSL_PPSL_MASK                  15U
#define PPSL_PPSL_BITNUM                0U


/*** PIEL - Port L Interrupt Enable Register; 0x0000026E ***/
typedef union {
  byte Byte;
  struct {
    byte PIEL0       :1;                                       /* Interrupt Enable Port L Bit 0 */
    byte PIEL1       :1;                                       /* Interrupt Enable Port L Bit 1 */
    byte PIEL2       :1;                                       /* Interrupt Enable Port L Bit 2 */
    byte PIEL3       :1;                                       /* Interrupt Enable Port L Bit 3 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpPIEL :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} PIELSTR;
extern volatile PIELSTR _PIEL @(REG_BASE + 0x0000026EUL);
#define PIEL                            _PIEL.Byte
#define PIEL_PIEL0                      _PIEL.Bits.PIEL0
#define PIEL_PIEL1                      _PIEL.Bits.PIEL1
#define PIEL_PIEL2                      _PIEL.Bits.PIEL2
#define PIEL_PIEL3                      _PIEL.Bits.PIEL3
#define PIEL_PIEL                       _PIEL.MergedBits.grpPIEL

#define PIEL_PIEL0_MASK                 1U
#define PIEL_PIEL1_MASK                 2U
#define PIEL_PIEL2_MASK                 4U
#define PIEL_PIEL3_MASK                 8U
#define PIEL_PIEL_MASK                  15U
#define PIEL_PIEL_BITNUM                0U


/*** PIFL - Port L Interrupt Flag Register; 0x0000026F ***/
typedef union {
  byte Byte;
  struct {
    byte PIFL0       :1;                                       /* Interrupt Flags Port L Bit 0 */
    byte PIFL1       :1;                                       /* Interrupt Flags Port L Bit 1 */
    byte PIFL2       :1;                                       /* Interrupt Flags Port L Bit 2 */
    byte PIFL3       :1;                                       /* Interrupt Flags Port L Bit 3 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpPIFL :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} PIFLSTR;
extern volatile PIFLSTR _PIFL @(REG_BASE + 0x0000026FUL);
#define PIFL                            _PIFL.Byte
#define PIFL_PIFL0                      _PIFL.Bits.PIFL0
#define PIFL_PIFL1                      _PIFL.Bits.PIFL1
#define PIFL_PIFL2                      _PIFL.Bits.PIFL2
#define PIFL_PIFL3                      _PIFL.Bits.PIFL3
#define PIFL_PIFL                       _PIFL.MergedBits.grpPIFL

#define PIFL_PIFL0_MASK                 1U
#define PIFL_PIFL1_MASK                 2U
#define PIFL_PIFL2_MASK                 4U
#define PIFL_PIFL3_MASK                 8U
#define PIFL_PIFL_MASK                  15U
#define PIFL_PIFL_BITNUM                0U


/*** PT1AD - Port AD Data Register; 0x00000271 ***/
typedef union {
  byte Byte;
  struct {
    byte PT1AD0      :1;                                       /* Port AD data bit 0 */
    byte PT1AD1      :1;                                       /* Port AD data bit 1 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpPT1AD :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} PT1ADSTR;
extern volatile PT1ADSTR _PT1AD @(REG_BASE + 0x00000271UL);
#define PT1AD                           _PT1AD.Byte
#define PT1AD_PT1AD0                    _PT1AD.Bits.PT1AD0
#define PT1AD_PT1AD1                    _PT1AD.Bits.PT1AD1
#define PT1AD_PT1AD                     _PT1AD.MergedBits.grpPT1AD

#define PT1AD_PT1AD0_MASK               1U
#define PT1AD_PT1AD1_MASK               2U
#define PT1AD_PT1AD_MASK                3U
#define PT1AD_PT1AD_BITNUM              0U


/*** PTI1AD - Port AD Input Register; 0x00000273 ***/
typedef union {
  byte Byte;
  struct {
    byte PTI1AD0     :1;                                       /* Port Input data register 1 port AD Bit 0 */
    byte PTI1AD1     :1;                                       /* Port Input data register 1 port AD Bit 1 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpPTI1AD :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} PTI1ADSTR;
