frostfire45/Codewarrior/Lib/hc12c/include/mc9s12vr16.h
extern volatile PTI1ADSTR _PTI1AD @(REG_BASE + 0x00000273UL);
#define PTI1AD                          _PTI1AD.Byte
#define PTI1AD_PTI1AD0                  _PTI1AD.Bits.PTI1AD0
#define PTI1AD_PTI1AD1                  _PTI1AD.Bits.PTI1AD1
#define PTI1AD_PTI1AD                   _PTI1AD.MergedBits.grpPTI1AD

#define PTI1AD_PTI1AD0_MASK             1U
#define PTI1AD_PTI1AD1_MASK             2U
#define PTI1AD_PTI1AD_MASK              3U
#define PTI1AD_PTI1AD_BITNUM            0U


/*** DDR1AD - Port AD Data Direction Register; 0x00000275 ***/
typedef union {
  byte Byte;
  struct {
    byte DDR1AD0     :1;                                       /* Port AD data direction bit 0 */
    byte DDR1AD1     :1;                                       /* Port AD data direction bit 1 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpDDR1AD :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} DDR1ADSTR;
extern volatile DDR1ADSTR _DDR1AD @(REG_BASE + 0x00000275UL);
#define DDR1AD                          _DDR1AD.Byte
#define DDR1AD_DDR1AD0                  _DDR1AD.Bits.DDR1AD0
#define DDR1AD_DDR1AD1                  _DDR1AD.Bits.DDR1AD1
#define DDR1AD_DDR1AD                   _DDR1AD.MergedBits.grpDDR1AD

#define DDR1AD_DDR1AD0_MASK             1U
#define DDR1AD_DDR1AD1_MASK             2U
#define DDR1AD_DDR1AD_MASK              3U
#define DDR1AD_DDR1AD_BITNUM            0U


/*** PER1AD - Port AD Pull Up Enable Register; 0x00000279 ***/
typedef union {
  byte Byte;
  struct {
    byte PER1AD0     :1;                                       /* Port AD pull up enable bit 0 */
    byte PER1AD1     :1;                                       /* Port AD pull up enable bit 1 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpPER1AD :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} PER1ADSTR;
extern volatile PER1ADSTR _PER1AD @(REG_BASE + 0x00000279UL);
#define PER1AD                          _PER1AD.Byte
#define PER1AD_PER1AD0                  _PER1AD.Bits.PER1AD0
#define PER1AD_PER1AD1                  _PER1AD.Bits.PER1AD1
#define PER1AD_PER1AD                   _PER1AD.MergedBits.grpPER1AD

#define PER1AD_PER1AD0_MASK             1U
#define PER1AD_PER1AD1_MASK             2U
#define PER1AD_PER1AD_MASK              3U
#define PER1AD_PER1AD_BITNUM            0U


/*** PPS1AD - Port AD Polarity Select Register; 0x0000027B ***/
typedef union {
  byte Byte;
  struct {
    byte PPS1AD0     :1;                                       /* Port AD Polarity Select Bit 0 */
    byte PPS1AD1     :1;                                       /* Port AD Polarity Select Bit 1 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpPPS1AD :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} PPS1ADSTR;
extern volatile PPS1ADSTR _PPS1AD @(REG_BASE + 0x0000027BUL);
#define PPS1AD                          _PPS1AD.Byte
#define PPS1AD_PPS1AD0                  _PPS1AD.Bits.PPS1AD0
#define PPS1AD_PPS1AD1                  _PPS1AD.Bits.PPS1AD1
#define PPS1AD_PPS1AD                   _PPS1AD.MergedBits.grpPPS1AD

#define PPS1AD_PPS1AD0_MASK             1U
#define PPS1AD_PPS1AD1_MASK             2U
#define PPS1AD_PPS1AD_MASK              3U
#define PPS1AD_PPS1AD_BITNUM            0U


/*** PIE1AD - Port AD Interrupt Enable Register; 0x0000027D ***/
typedef union {
  byte Byte;
  struct {
    byte PIE1AD0     :1;                                       /* Port AD Interrupt Enable Bit 0 */
    byte PIE1AD1     :1;                                       /* Port AD Interrupt Enable Bit 1 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpPIE1AD :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} PIE1ADSTR;
extern volatile PIE1ADSTR _PIE1AD @(REG_BASE + 0x0000027DUL);
#define PIE1AD                          _PIE1AD.Byte
#define PIE1AD_PIE1AD0                  _PIE1AD.Bits.PIE1AD0
#define PIE1AD_PIE1AD1                  _PIE1AD.Bits.PIE1AD1
#define PIE1AD_PIE1AD                   _PIE1AD.MergedBits.grpPIE1AD

#define PIE1AD_PIE1AD0_MASK             1U
#define PIE1AD_PIE1AD1_MASK             2U
#define PIE1AD_PIE1AD_MASK              3U
#define PIE1AD_PIE1AD_BITNUM            0U


/*** PIF1AD - Port AD Interrupt Flag Register; 0x0000027F ***/
typedef union {
  byte Byte;
  struct {
    byte PIF1AD0     :1;                                       /* Pin Interrupt Flag register 1 port AD Bit 0 */
    byte PIF1AD1     :1;                                       /* Pin Interrupt Flag register 1 port AD Bit 1 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpPIF1AD :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} PIF1ADSTR;
extern volatile PIF1ADSTR _PIF1AD @(REG_BASE + 0x0000027FUL);
#define PIF1AD                          _PIF1AD.Byte
#define PIF1AD_PIF1AD0                  _PIF1AD.Bits.PIF1AD0
#define PIF1AD_PIF1AD1                  _PIF1AD.Bits.PIF1AD1
#define PIF1AD_PIF1AD                   _PIF1AD.MergedBits.grpPIF1AD

#define PIF1AD_PIF1AD0_MASK             1U
#define PIF1AD_PIF1AD1_MASK             2U
#define PIF1AD_PIF1AD_MASK              3U
#define PIF1AD_PIF1AD_BITNUM            0U


/*** CPMUHTCTL - High Temperature Control Register; 0x000002F0 ***/
typedef union {
  byte Byte;
  struct {
    byte HTIF        :1;                                       /* High Temperature Interrupt Flag */
    byte HTIE        :1;                                       /* High Temperature Interrupt Enable Bit */
    byte HTDS        :1;                                       /* High Temperature Detect Status Bi */
    byte HTE         :1;                                       /* High Temperature Sensor/Bandgap Voltage Enable Bit */
    byte             :1; 
    byte VSEL        :1;                                       /* Voltage Access Select Bit */
    byte             :1; 
    byte             :1; 
  } Bits;
} CPMUHTCTLSTR;
extern volatile CPMUHTCTLSTR _CPMUHTCTL @(REG_BASE + 0x000002F0UL);
#define CPMUHTCTL                       _CPMUHTCTL.Byte
#define CPMUHTCTL_HTIF                  _CPMUHTCTL.Bits.HTIF
#define CPMUHTCTL_HTIE                  _CPMUHTCTL.Bits.HTIE
#define CPMUHTCTL_HTDS                  _CPMUHTCTL.Bits.HTDS
#define CPMUHTCTL_HTE                   _CPMUHTCTL.Bits.HTE
#define CPMUHTCTL_VSEL                  _CPMUHTCTL.Bits.VSEL

#define CPMUHTCTL_HTIF_MASK             1U
#define CPMUHTCTL_HTIE_MASK             2U
#define CPMUHTCTL_HTDS_MASK             4U
#define CPMUHTCTL_HTE_MASK              8U
#define CPMUHTCTL_VSEL_MASK             32U


